SrPatinhas/smarthalo-firmware/smart_halo-nrf5_sdk-e414c91a3966/SDK11/examples/ble_peripheral/ble_app_cts_c/main.c
static const char * day_of_week[8]    = {"Unknown",
                                         "Monday",
                                         "Tuesday",
                                         "Wednesday",
                                         "Thursday",
                                         "Friday",
                                         "Saturday",
                                         "Sunday"};

static const char * month_of_year[13] = {"Unknown",
                                         "January",
                                         "February",
                                         "March",
                                         "April",
                                         "May",
                                         "June",
                                         "July",
                                         "August",
                                         "September",
                                         "October",
                                         "November",
                                         "December"};


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num  Line number of the failing ASSERT call.
 * @param[in] file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling the Current Time Service errors.
 *
 * @param[in]  nrf_error  Error code containing information about what went wrong.
 */
static void current_time_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the security request timer time-out.
 *
 * @details This function will be called each time the security request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the time-out handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t             err_code;
    dm_security_status_t status;

    if (m_peer_handle.connection_id != DM_INVALID_ID)
    {
        err_code = dm_security_status_req(&m_peer_handle, &status);
        APP_ERROR_CHECK(err_code);

        // If the link is still not secured by the peer, initiate security procedure.
        if (status == NOT_ENCRYPTED)
        {
            err_code = dm_security_setup_req(&m_peer_handle);
            APP_ERROR_CHECK(err_code);
        }
    }
}


/**@brief Function for handling the Current Time Service errors.
 *
 * @param[in] p_evt  Event received from the Current Time Service client.
 */
static void current_time_print(ble_cts_c_evt_t * p_evt)
{
    NRF_LOG("\nCurrent Time:\r\n");
    NRF_LOG("\nDate:\r\n");

    NRF_LOG_PRINTF("\tDay of week   %s\r\n", day_of_week[p_evt->
                                               params.
                                               current_time.
                                               exact_time_256.
                                               day_date_time.
                                               day_of_week]);

    if (p_evt->params.current_time.exact_time_256.day_date_time.date_time.day == 0)
    {
        NRF_LOG("\tDay of month  Unknown\r\n");
    }
    else
    {
        NRF_LOG_PRINTF("\tDay of month  %i\r\n",
               p_evt->params.current_time.exact_time_256.day_date_time.date_time.day);
    }

    NRF_LOG_PRINTF("\tMonth of year %s\r\n",
           month_of_year[p_evt->params.current_time.exact_time_256.day_date_time.date_time.month]);
    if (p_evt->params.current_time.exact_time_256.day_date_time.date_time.year == 0)
    {
        NRF_LOG("\tYear          Unknown\r\n");
    }
    else
    {
        NRF_LOG_PRINTF("\tYear          %i\r\n",
               p_evt->params.current_time.exact_time_256.day_date_time.date_time.year);
    }
    NRF_LOG("\nTime:\n");
    NRF_LOG_PRINTF("\tHours     %i\r\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.hours);
    NRF_LOG_PRINTF("\tMinutes   %i\r\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.minutes);
    NRF_LOG_PRINTF("\tSeconds   %i\r\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.seconds);
    NRF_LOG_PRINTF("\tFractions %i/256 of a second\r\n",
           p_evt->params.current_time.exact_time_256.fractions256);

    NRF_LOG("\nAdjust reason:\r\n");
    NRF_LOG_PRINTF("\tDaylight savings %x\r\n",
           p_evt->params.current_time.adjust_reason.change_of_daylight_savings_time);
    NRF_LOG_PRINTF("\tTime zone        %x\r\n",
           p_evt->params.current_time.adjust_reason.change_of_time_zone);
    NRF_LOG_PRINTF("\tExternal update  %x\r\n",
           p_evt->params.current_time.adjust_reason.external_reference_time_update);
    NRF_LOG_PRINTF("\tManual update    %x\r\n",
           p_evt->params.current_time.adjust_reason.manual_time_update);
}


/**@brief Function for the timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create security request timer.
    err_code = app_timer_create(&m_sec_req_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                sec_req_timeout_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for handling the Current Time Service client events.
 *
 * @details This function will be called for all events in the Current Time Service client that
 *          are passed to the application.
 *
 * @param[in] p_evt Event received from the Current Time Service client.
 */
static void on_cts_c_evt(ble_cts_c_t * p_cts, ble_cts_c_evt_t * p_evt)
{
    uint32_t err_code;

    switch (p_evt->evt_type)
    {
        case BLE_CTS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG("Current Time Service discovered on server.\n\r");
            err_code = ble_cts_c_handles_assign(&m_cts,p_evt->conn_handle, &p_evt->params.char_handles);
            APP_ERROR_CHECK(err_code);
            break;

